chunyen627-afk/stm32h7s78-project/projects/video/app_src/video_main.c
/**
 * MJPEG 影片播放：先量真實格率，再談功能。
 *
 * 這個專案的存在理由是相簿那邊留下的一個未解問題：JPEG 硬體用 DMA 解碼在
 * **隔離測試裡完全正確**（輸出與輪詢逐位元組相同、連續 40 次穩定、快 4.8 倍），
 * 但整合進相簿的正式路徑就會在第一張之後把週邊卡死，連 HAL_JPEG_Abort()
 * 都救不回來（board-notes 16.6）。唯一的差別是「兩次解碼之間夾了什麼」——
 * 隔離測試背對背連續呼叫，相簿中間隔著 SD 讀檔、轉色、縮放、顯示與等待。
 *
 * 影片正好是那個問題的極端版本：每秒要連續解二十幾次，而且中間夾著轉色與
 * 換頁。在一個乾淨的環境裡處理它，比在相簿裡邊改邊壞好得多。
 *
 * 刻意砍掉的東西：沒有 SD（影格燒在外部 Flash 的空白區，記憶體映射直接讀）、
 * 沒有觸控、沒有選單、沒有中文字型、沒有縮放（影格已經是面板尺寸）。
 * 留下的只有「解碼 -> 轉色 -> 顯示」這條最短路徑，這樣量到的數字才乾淨。
 */
#include "main.h"
#include "stm32h7s78_discovery_lcd.h"
#include "jpeg_utils.h"
#include "ff.h"
#include "ff_gen_drv.h"

#include <stdbool.h>
#include <string.h>

/* 影格包有兩個來源，開機時自動判斷：
 *
 *   SD 卡 0:/video.bin  —— 長片走這裡。128MB 的外部 Flash 放不下五分鐘的
 *                          MJPEG（實測約 137MB），而 SD 卡沒有這個限制。
 *   外部 Flash 0x71000000 —— 短片走這裡。記憶體映射，可以就地讀、零複製，
 *                          是最快也最單純的路徑，拿來驗證管線很好用。
 *
 * 先試 SD，沒有卡或沒有檔案就自動退回 Flash。兩條路都保留的理由跟相簿
 * 那個「DMA 失敗就退回輪詢」一樣：讓一條路壞掉變成「換一條」而不是「不能用」。 */
#define FRAMES_BASE     ((const uint8_t *)0x71000000u)
#define FRAMES_MAGIC    0x32524656u          /* 'VFR2' 小端序 */
#define SD_VIDEO_PATH   "0:/video.bin"

/* 面板實體尺寸。影片專案不畫任何 UI，所以不引入繪圖層 —— 它會拉進
 * 中文字型表，對一個只顯示影格的韌體是純粹的負擔。 */
#define PHYS_W          800
#define PHYS_H          480

#define FB0_ADDR        LCD_LAYER_0_ADDRESS  /* 0x90000000 */
#define FB1_ADDR        LCD_LAYER_1_ADDRESS  /* 0x90200000 */

/* PSRAM：YCbCr 中間緩衝區。800x480 的 4:2:0 只要 576KB，配 2MB 有餘裕。 */
#define YCBCR_BUF       ((uint8_t *)0x90600000u)
#define YCBCR_CAP       (2u * 1024u * 1024u)

/* 從 SD 讀進來的單格 JPEG 放這裡。實測 800x480 q:v 5 每格約 19KB、
 * 最大 25KB，配 1MB 是為了以後換更高品質的素材也不用改。
 * Flash 來源不會用到這塊 —— 記憶體映射可以直接就地解碼。 */
#define FRAME_BUF       ((uint8_t *)0x90900000u)
#define FRAME_CAP       (1u * 1024u * 1024u)

/* 位移表。7200 格只要 57.6KB，配 2MB 可以到 26 萬格（約三小時）。 */
#define TBL_BUF         ((uint32_t *)0x90A00000u)
#define TBL_CAP         (2u * 1024u * 1024u)

/* HPDMA 的區塊大小欄位只有 16 位元，而 HAL 是 (size & 0xFFFF) 遮掉、不檢查。
 * 一次交出整塊會被默默截斷或直接變成 0，所以必須分塊餵（board-notes 16.2）。 */
#define CHUNK           (32u * 1024u)

/* 素材格率改成從檔頭讀，不再寫死 —— 不同影片的格率不一樣，寫死的話
 * 27fps 的素材用 24fps 播會愈跑愈慢。這個是退回用的預設值。 */
#define DEFAULT_FPS_X100  2400u

typedef struct {
    uint32_t magic, count, width, height, fps_x100, max_size;
} frames_hdr_t;

static JPEG_HandleTypeDef  g_hjpeg;
static DMA2D_HandleTypeDef g_hdma2d;
static bool                g_dma2d_ready;
static DMA_HandleTypeDef  g_dma_in;
static DMA_HandleTypeDef  g_dma_out;
static uint32_t           g_front;

static volatile uint8_t   g_done;        /* 0=進行中 1=完成 2=錯誤 */
static volatile uint32_t  g_out_total;
static const uint8_t     *g_in_ptr;
static uint32_t           g_in_left;

/* 診斷用，SWD 讀得到。板子沒有 UART，狀態一律走這裡。 */
volatile uint32_t g_dbg_stage;
volatile uint32_t g_dbg_nframe;          /* 已顯示的影格數 */
volatile uint32_t g_dbg_fail;            /* 解碼失敗次數 */
volatile int32_t  g_dbg_lasterr;
volatile uint32_t g_dbg_jerr, g_dbg_derr_in, g_dbg_derr_out;
volatile uint32_t g_dbg_hdr_magic, g_dbg_hdr_count, g_dbg_hdr_w, g_dbg_hdr_h;

/* 每一段的累計微秒與影格數，算平均用。單格數字會跳，看平均才準。 */
volatile uint32_t g_dbg_sum_dec, g_dbg_sum_cc, g_dbg_sum_out, g_dbg_sum_all;
volatile uint32_t g_dbg_fps_x100;        /* 實測格率 x100 */
volatile uint32_t g_dbg_late;            /* 跟不上素材格率的次數 */

/* 診斷開關，SWD 可寫：
 *   g_dbg_freeze  非 0 = 一直顯示第 0 格。真正靜止的畫面還在閃的話，
 *                 問題在 PSRAM/LTDC 層級；不閃就是格與格之間的問題。
 *   g_dbg_nopresent 非 0 = 不換頁，只解碼轉色。用來分離「顯示」與「產生內容」。 */
/* LTDC 的 FIFO 供不上（underrun）與傳輸錯誤。
 *
 * DMA2D 現在會突發地猛寫 PSRAM，而 LTDC 同時要每秒 60 次從同一塊 PSRAM
 * 讀完整個畫面 —— 相簿從來沒用過 DMA2D，這是全新的匯流排競爭。
 * 「整個畫面快速亮滅」正是 underrun 的典型症狀。
 *
 * 這些旗標是黏著的，開機瞬間發生過一次就會一直是 1，所以每格讀完就清掉、
 * 用計數跟格數對比才有意義（board-notes 10.5 那個假線索）。 */
/* 直接數「轉色寫進哪一塊」與「present 被呼叫幾次」。
 * OMAR 永遠是 FB1、g_front 卻會變 1，兩者矛盾 —— 不再靠推理。 */
volatile uint32_t g_dbg_to_fb0, g_dbg_to_fb1, g_dbg_present;

volatile uint32_t g_dbg_ltdc_fu;         /* FIFO underrun 次數 */
volatile uint32_t g_dbg_ltdc_te;         /* 傳輸錯誤次數 */

volatile uint32_t g_dbg_freeze;
volatile uint32_t g_dbg_nopresent;

/* ---- 解碼失敗的診斷（26% 的影格 jerr=ERROR_DMA）----------------------
 *
 * 已知的事實：失敗率兩次取樣都是 26.7%，除以圈數剛好是 120 格裡固定 32 格 ——
 * 也就是**確定性的、跟影格內容相關**，不是隨機競爭。所以要問的不是「什麼時候
 * 壞」而是「哪 32 格、它們有什麼共同點」。
 *
 * failmap/okmap 用位元記錄每個索引的結果（120 格 = 4 個字），這樣一次 SWD
 * 讀取就拿到完整的失敗集合，不必反覆試。
 *
 * snap[] 凍結在**第一次**失敗的當下，記錄 HAL 與 DMA 通道的實際設定。
 * USE（user setting error）是硬體在啟動時對設定的抱怨 —— 位址對齊、
 * 區塊長度與資料寬度不相容都會觸發，把 CSAR/CBR1 讀出來就知道是哪一個，
 * 不用在幾種可能之間猜（board-notes 16.4 就是靠這招一次定位的）。 */
volatile uint32_t g_dbg_failmap[4];
volatile uint32_t g_dbg_okmap[4];
volatile uint32_t g_dbg_snap[24];
volatile uint32_t g_dbg_snap_done;

static uint32_t       g_cur_idx;         /* 正在解的影格索引 */
static uint32_t       g_cur_size;
static const uint8_t *g_cur_jpg;
static uint32_t       g_in_cb;           /* 這格呼叫了幾次 GetDataCallback */
static uint32_t       g_out_cb;

static uint32_t g_next_ms;               /* 下一格該顯示的時刻 */

static inline uint32_t cyc_start(void) { return DWT->CYCCNT; }
static inline uint32_t cyc_us(uint32_t t0)
{
    return (DWT->CYCCNT - t0) / (SystemCoreClock / 1000000u);
}

/* ------------------------------------------------------------------ */
/* JPEG 回呼：分塊接續                                                  */
/* ------------------------------------------------------------------ */

void HAL_JPEG_DataReadyCallback(JPEG_HandleTypeDef *hjpeg, uint8_t *pDataOut,
                                uint32_t OutDataLength)
{
    uint32_t end = (uint32_t)(pDataOut - YCBCR_BUF) + OutDataLength;
    uint32_t left;

    g_out_cb++;
    if (end > g_out_total) {
        g_out_total = end;      /* 取最大值不累加：HAL 可能對同一批回呼兩次 */
    }
    left = (end < YCBCR_CAP) ? (YCBCR_CAP - end) : 0u;
    if (left > CHUNK) { left = CHUNK; }
    if (left >= 4u) {
        (void)HAL_JPEG_ConfigOutputBuffer(hjpeg, YCBCR_BUF + end, left);
    }
}

void HAL_JPEG_GetDataCallback(JPEG_HandleTypeDef *hjpeg, uint32_t NbDecodedData)
{
    uint32_t n;

    g_in_cb++;
    if (NbDecodedData >= g_in_left) {
        g_in_left = 0;
        /* 沒有資料了要**明講**。HAL 的說明寫得很清楚：輸入結束時要用
         * InDataLength = 0 呼叫一次。直接 return 的話 pJpegInBuffPtr 與
         * InDataLength 都留著上一次的值，而 JPEG_DMAInCpltCallback 只檢查
         * 「InDataLength > 0」就重啟 DMA —— 等於把同一塊資料再送一次。 */
        HAL_JPEG_ConfigInputBuffer(hjpeg, (uint8_t *)g_in_ptr, 0u);
        return;
    }
    g_in_ptr  += NbDecodedData;
    g_in_left -= NbDecodedData;
    n = (g_in_left > CHUNK) ? CHUNK : g_in_left;

    /* 長度一定要是 4 的倍數。
     *
     * HPDMA 的來源／目的資料寬度都設成 word，BNDT 不是 4 的倍數硬體就報
     * USE（user setting error）。HAL 只在長度 >= 4 時幫忙進位，剩 1~3 個
     * 位元組時那條分支是「Nothing to do」，把 2 原封不動送進 DMA。
     *
     * 這就是 26% 影格解碼失敗的全部原因：JPEG 核心消耗的量永遠是 4 的倍數，
     * 所以整包一次餵完的小影格會在最後剩下 size%4 個位元組。實測 48 張單塊
     * 影格裡 size%4!=0 的 32 張**每一次都失敗**、size%4==0 的 16 張全過，
     * 72 張要分塊的大影格因為尾段夠長（HAL 會進位）也全過 —— 32/120 = 26.7%。
     *
     * 往上取整是安全的：packframes.py 把每格補齊到 4 位元組邊界，多讀到的
     * 是補的 0，而且落在 EOI 之後，解碼器不會理它。 */
    n = (n + 3u) & ~3u;
    HAL_JPEG_ConfigInputBuffer(hjpeg, (uint8_t *)g_in_ptr, n);
}

void HAL_JPEG_DecodeCpltCallback(JPEG_HandleTypeDef *hjpeg) { (void)hjpeg; g_done = 1u; }

void HAL_JPEG_ErrorCallback(JPEG_HandleTypeDef *hjpeg)
{
    g_done = 2u;

