chunyen627-afk/stm32h7s78-project/projects/video/app_src/video_main.c
    /* 只留第一次的現場。之後的失敗會覆蓋掉最有價值的那一筆，而且
     * 錯誤碼在後續的 DeInit/Init 會被清成 0（board-notes 已經吃過這個虧）。 */
    if (g_dbg_snap_done != 0u) {
        return;
    }
    g_dbg_snap[0]  = g_cur_idx;
    g_dbg_snap[1]  = g_cur_size;
    g_dbg_snap[2]  = g_in_cb;
    g_dbg_snap[3]  = g_out_cb;
    g_dbg_snap[4]  = (uint32_t)(g_in_ptr - g_cur_jpg);   /* 輸入消耗到哪 */
    g_dbg_snap[5]  = g_in_left;
    g_dbg_snap[6]  = g_out_total;
    g_dbg_snap[7]  = hjpeg->InDataLength;
    g_dbg_snap[8]  = (uint32_t)hjpeg->pJpegInBuffPtr;
    g_dbg_snap[9]  = hjpeg->OutDataLength;
    g_dbg_snap[10] = (uint32_t)hjpeg->pJpegOutBuffPtr;
    g_dbg_snap[11] = hjpeg->ErrorCode;
    g_dbg_snap[12] = (uint32_t)hjpeg->State;
    g_dbg_snap[13] = hjpeg->Context;
    /* 輸入通道（HPDMA1_Channel0）的實際設定：USE 就是硬體對這幾個值的抱怨 */
    g_dbg_snap[14] = HPDMA1_Channel0->CSAR;
    g_dbg_snap[15] = HPDMA1_Channel0->CDAR;
    g_dbg_snap[16] = HPDMA1_Channel0->CBR1;
    g_dbg_snap[17] = HPDMA1_Channel0->CTR1;
    g_dbg_snap[18] = HPDMA1_Channel0->CSR;
    /* 輸出通道（HPDMA1_Channel1） */
    g_dbg_snap[19] = HPDMA1_Channel1->CDAR;
    g_dbg_snap[20] = HPDMA1_Channel1->CBR1;
    g_dbg_snap[21] = HPDMA1_Channel1->CSR;
    g_dbg_snap[22] = g_dma_in.ErrorCode;
    g_dbg_snap[23] = g_dma_out.ErrorCode;
    g_dbg_snap_done = 1u;
}

void HPDMA1_Channel0_IRQHandler(void) { HAL_DMA_IRQHandler(&g_dma_in); }
void HPDMA1_Channel1_IRQHandler(void) { HAL_DMA_IRQHandler(&g_dma_out); }
void JPEG_IRQHandler(void)            { HAL_JPEG_IRQHandler(&g_hjpeg); }

void HAL_JPEG_MspInit(JPEG_HandleTypeDef *hjpeg)
{
    if (hjpeg->Instance != JPEG) {
        return;
    }
    __HAL_RCC_JPEG_CLK_ENABLE();
    /* 這行 ST 的範例放在獨立的 MX_HPDMA1_Init()，很容易漏 —— 漏了的話
     * HAL_DMA_Init() 照樣回傳 HAL_OK，但傳輸永遠不會開始。 */
    __HAL_RCC_HPDMA1_CLK_ENABLE();

    g_dma_out.Instance                  = HPDMA1_Channel1;
    g_dma_out.Init.Request              = HPDMA1_REQUEST_JPEG_TX;
    g_dma_out.Init.BlkHWRequest         = DMA_BREQ_SINGLE_BURST;
    g_dma_out.Init.Direction            = DMA_PERIPH_TO_MEMORY;
    g_dma_out.Init.SrcInc               = DMA_SINC_FIXED;
    g_dma_out.Init.DestInc              = DMA_DINC_INCREMENTED;
    g_dma_out.Init.SrcDataWidth         = DMA_SRC_DATAWIDTH_WORD;
    g_dma_out.Init.DestDataWidth        = DMA_DEST_DATAWIDTH_WORD;
    g_dma_out.Init.Priority             = DMA_LOW_PRIORITY_LOW_WEIGHT;
    g_dma_out.Init.SrcBurstLength       = 8;
    g_dma_out.Init.DestBurstLength      = 8;
    g_dma_out.Init.TransferAllocatedPort =
        DMA_SRC_ALLOCATED_PORT1 | DMA_DEST_ALLOCATED_PORT0;
    g_dma_out.Init.TransferEventMode    = DMA_TCEM_BLOCK_TRANSFER;
    g_dma_out.Init.Mode                 = DMA_NORMAL;
    (void)HAL_DMA_Init(&g_dma_out);
    __HAL_LINKDMA(hjpeg, hdmaout, g_dma_out);

    g_dma_in.Instance                   = HPDMA1_Channel0;
    g_dma_in.Init.Request               = HPDMA1_REQUEST_JPEG_RX;
    g_dma_in.Init.BlkHWRequest          = DMA_BREQ_SINGLE_BURST;
    g_dma_in.Init.Direction             = DMA_MEMORY_TO_PERIPH;
    g_dma_in.Init.SrcInc                = DMA_SINC_INCREMENTED;
    g_dma_in.Init.DestInc               = DMA_DINC_FIXED;
    g_dma_in.Init.SrcDataWidth          = DMA_SRC_DATAWIDTH_WORD;
    g_dma_in.Init.DestDataWidth         = DMA_DEST_DATAWIDTH_WORD;
    g_dma_in.Init.Priority              = DMA_LOW_PRIORITY_LOW_WEIGHT;
    g_dma_in.Init.SrcBurstLength        = 8;
    g_dma_in.Init.DestBurstLength       = 8;
    g_dma_in.Init.TransferAllocatedPort =
        DMA_SRC_ALLOCATED_PORT0 | DMA_DEST_ALLOCATED_PORT1;
    g_dma_in.Init.TransferEventMode     = DMA_TCEM_BLOCK_TRANSFER;
    g_dma_in.Init.Mode                  = DMA_NORMAL;
    (void)HAL_DMA_Init(&g_dma_in);
    __HAL_LINKDMA(hjpeg, hdmain, g_dma_in);

    HAL_NVIC_SetPriority(HPDMA1_Channel0_IRQn, 6, 0);
    HAL_NVIC_EnableIRQ(HPDMA1_Channel0_IRQn);
    HAL_NVIC_SetPriority(HPDMA1_Channel1_IRQn, 6, 0);
    HAL_NVIC_EnableIRQ(HPDMA1_Channel1_IRQn);
    HAL_NVIC_SetPriority(JPEG_IRQn, 6, 0);
    HAL_NVIC_EnableIRQ(JPEG_IRQn);
}

/* ------------------------------------------------------------------ */
/* DMA2D 轉色                                                          */
/* ------------------------------------------------------------------ */

/* YCbCr -> RGB565 交給硬體。
 *
 * 實測 CPU 轉色佔每格 91%（64ms / 70ms），解碼只佔 3.6% —— 這是唯一值得
 * 動的地方。DMA2D 支援 YCbCr 輸入（DMA2D_INPUT_YCBCR + 三種色度取樣），
 * 而 JPEG 解碼器吐出來的正是它要的 MCU 區塊排列，兩者直接接得上。
 *
 * 附帶好處：DMA2D 讀 YCbCr、寫 framebuffer 都繞過 D-Cache，所以轉色前
 * 那次 SCB_InvalidateDCache_by_Addr（CPU 要讀才需要）可以省掉。
 *
 * css 用 JPEG 回報的取樣格式對應過去：HAL 的 0=4:4:4、1=4:2:0、2=4:2:2，
 * 而 DMA2D 是 NO_CSS / CSS_420 / CSS_422 —— 兩邊的編號不一樣，
 * 照抄會錯得很難查（board-notes 11.1 那個 4:4:4 誤認的同一類陷阱）。 */
static bool dma2d_setup(uint32_t jpeg_css)
{
    uint32_t css;

    if (jpeg_css == JPEG_420_SUBSAMPLING) {
        css = DMA2D_CSS_420;
    } else if (jpeg_css == JPEG_422_SUBSAMPLING) {
        css = DMA2D_CSS_422;
    } else {
        css = DMA2D_NO_CSS;
    }

    __HAL_RCC_DMA2D_CLK_ENABLE();

    g_hdma2d.Instance                 = DMA2D;
    g_hdma2d.Init.Mode                = DMA2D_M2M_PFC;   /* 搬運 + 格式轉換 */
    g_hdma2d.Init.ColorMode           = DMA2D_OUTPUT_RGB565;
    g_hdma2d.Init.OutputOffset        = 0;               /* 影格就是整個畫面 */

    g_hdma2d.LayerCfg[1].InputOffset        = 0;
    g_hdma2d.LayerCfg[1].InputColorMode     = DMA2D_INPUT_YCBCR;
    g_hdma2d.LayerCfg[1].ChromaSubSampling  = css;
    g_hdma2d.LayerCfg[1].AlphaMode          = DMA2D_NO_MODIF_ALPHA;
    g_hdma2d.LayerCfg[1].InputAlpha         = 0xFFu;

    if (HAL_DMA2D_Init(&g_hdma2d) != HAL_OK) {
        return false;
    }
    if (HAL_DMA2D_ConfigLayer(&g_hdma2d, 1) != HAL_OK) {
        return false;
    }
    return true;
}

/* 每格直接寫暫存器啟動，不走 HAL_DMA2D_Start。
 *
 * 為什麼：HAL_DMA2D_Start() 會把 hdma2d.State 設成 BUSY，而負責設回 READY 的
 * 是 HAL_DMA2D_PollForTransfer()。但那個函式的等待迴圈包在 if (CR & START) 裡，
 * 傳輸太快時整個等待會被跳過（board-notes 3.3），所以我們改成自己輪詢 START。
 * 代價是 State 永遠停在 BUSY —— **第二次之後 HAL_DMA2D_Start 直接回傳
 * HAL_BUSY 什麼都不做**。
 *
 * 症狀非常具人欺騙性：程式邏輯正確地輪流指定兩塊 framebuffer（實測
 * to_fb0=255、to_fb1=259），但硬體的 OMAR 永遠停在第一次那個位址，
 * 另一塊從頭到尾是黑的 —— 畫面就在第一格與全黑之間交替閃爍。
 * 回傳值被 (void) 丟掉，所以完全沒有錯誤跡象。
 *
 * 相簿的 dma2d.c 早就是直接寫暫存器（board-notes 3.3），這裡照做。
 * Init/ConfigLayer 仍用 HAL，那是一次性的、不涉及狀態機。 */
static void dma2d_convert(uint8_t *dst, uint32_t w, uint32_t h)
{
    DMA2D->FGMAR = (uint32_t)YCBCR_BUF;
    DMA2D->OMAR  = (uint32_t)dst;
    DMA2D->NLR   = (w << DMA2D_NLR_PL_Pos) | h;
    DMA2D->IFCR  = DMA2D_IFCR_CTCIF | DMA2D_IFCR_CTEIF | DMA2D_IFCR_CCEIF;
    DMA2D->CR   |= DMA2D_CR_START;

