chunyen627-afk/stm32h7s78-project/projects/video/app_src/video_main.c
    /* 看 START 位不要看旗標。 */
    while ((DMA2D->CR & DMA2D_CR_START) != 0u) { }
    __DSB();
}

/* ------------------------------------------------------------------ */
/* 初始化                                                              */
/* ------------------------------------------------------------------ */

static void psram_mpu_init(void)
{
    MPU_Region_InitTypeDef mpu = {0};

    /* framebuffer 與 YCbCr 都被硬體讀寫（LTDC / JPEG DMA），維持 write-through
     * 才不會讓 CPU 的寫入卡在快取裡（board-notes 2.4）。 */
    HAL_MPU_Disable();
    mpu.Enable           = MPU_REGION_ENABLE;
    mpu.Number           = MPU_REGION_NUMBER7;
    mpu.BaseAddress      = 0x90000000u;
    mpu.Size             = MPU_REGION_SIZE_32MB;
    mpu.AccessPermission = MPU_REGION_FULL_ACCESS;
    mpu.IsShareable      = MPU_ACCESS_NOT_SHAREABLE;
    mpu.IsCacheable      = MPU_ACCESS_CACHEABLE;
    mpu.IsBufferable     = MPU_ACCESS_NOT_BUFFERABLE;
    mpu.TypeExtField     = MPU_TEX_LEVEL0;
    mpu.SubRegionDisable = 0x00;
    mpu.DisableExec      = MPU_INSTRUCTION_ACCESS_DISABLE;
    HAL_MPU_ConfigRegion(&mpu);
    HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);
    SCB_CleanInvalidateDCache();
}

static void screen_init(void)
{
    /* BSP 預設 ARGB8888，不指定 RGB565 的話會用錯的列距讀，畫面橫向重複。 */
    if (BSP_LCD_InitEx(0, LCD_ORIENTATION_LANDSCAPE, LCD_PIXEL_FORMAT_RGB565,
                       PHYS_W, PHYS_H) != BSP_ERROR_NONE) {
        Error_Handler();
    }
    for (uint32_t i = 0; i < (uint32_t)PHYS_W * PHYS_H; i++) {
        ((uint16_t *)FB0_ADDR)[i] = 0;
        ((uint16_t *)FB1_ADDR)[i] = 0;
    }
    BSP_LCD_SetLayerAddress(0, 0, FB0_ADDR);
    BSP_LCD_Reload(0, BSP_LCD_RELOAD_NONE);
    BSP_LCD_DisplayOn(0);
    /* DisplayOn 不會開背光，DisplayOff 卻會關 —— 要自己把 GPIOG15 拉高
     * （board-notes 12.1）。 */
    HAL_GPIO_WritePin(GPIOG, GPIO_PIN_15, GPIO_PIN_SET);
    g_front = 0;
}

static void present(void)
{
    /* 只寫 CFBAR：它是 shadow register，等垂直消隱重載時整批原子切換。
     * 用 BSP_LCD_SetLayerAddress 會重寫整組圖層暫存器而撕裂（board-notes 2.2）。 */
    /* g_front 是「目前顯示中」的索引，所以剛畫好的是另一塊。
     * 這裡顯示剛畫好的那塊，然後翻面 —— 繪製目標與這裡必須永遠相反，
     * 寫反的話每格都在顯示沒畫過的緩衝區，靜止畫面也會閃（board-notes 2.3）。 */
    {
        uint32_t isr = LTDC->ISR;

        if ((isr & LTDC_ISR_FUIF) != 0u) { g_dbg_ltdc_fu++; }
        if ((isr & LTDC_ISR_TERRIF) != 0u) { g_dbg_ltdc_te++; }
        LTDC->ICR = LTDC_ICR_CFUIF | LTDC_ICR_CTERRIF;
    }

    g_dbg_present++;
    LTDC_Layer1->CFBAR = g_front ? FB0_ADDR : FB1_ADDR;
    LTDC->SRCR = LTDC_SRCR_VBR;
    for (uint32_t g = 0; g < 2000000u; g++) {
        if ((LTDC->SRCR & LTDC_SRCR_VBR) == 0u) { break; }
    }
    g_front ^= 1u;
}

/* ------------------------------------------------------------------ */
/* 影格來源：SD 卡優先，退回外部 Flash                                   */
/* ------------------------------------------------------------------ */

extern const Diskio_drvTypeDef SD_BSP_Driver;
bool sd_writer_requested(void);
void sd_writer_run(void);

static FATFS        g_fs;
static FIL          g_fil;
static char         g_drive[4];
static bool         g_src_sd;
static bool         g_fs_mounted;
static frames_hdr_t g_hdr;
static const uint32_t *g_tbl;     /* Flash：指進映射區；SD：指向 TBL_BUF */

volatile uint32_t g_dbg_src;      /* 0=都沒有 1=SD 2=Flash */
volatile int32_t  g_dbg_fs_err;   /* 最後一次 FatFs 的錯誤碼 */
volatile uint32_t g_dbg_sum_read; /* 從 SD 讀影格的累計微秒 */

static bool hdr_valid(const frames_hdr_t *h)
{
    return h->magic == FRAMES_MAGIC && h->count != 0u &&
           h->width == PHYS_W && h->height == PHYS_H &&
           (uint64_t)h->count * 8u <= TBL_CAP &&
           h->max_size != 0u && ((h->max_size + 3u) & ~3u) <= FRAME_CAP;
}

/* SD：把檔頭與位移表讀進 PSRAM，影格本體留在卡上按需讀取。
 * 位移表 7200 格只有 57.6KB，開機讀一次就好，之後每格只要 f_lseek + f_read。 */
static bool src_open_sd(void)
{
    UINT got = 0;

    if (FATFS_LinkDriver(&SD_BSP_Driver, g_drive) != 0) {
        return false;
    }
    /* 第三個參數 1 = 立刻掛載。延後掛載會讓錯誤拖到第一次 f_open 才出現。 */
    g_dbg_fs_err = (int32_t)f_mount(&g_fs, g_drive, 1);
    if (g_dbg_fs_err != FR_OK) {
        return false;
    }
    g_fs_mounted = true;

    g_dbg_fs_err = (int32_t)f_open(&g_fil, SD_VIDEO_PATH, FA_READ);
    if (g_dbg_fs_err != FR_OK) {
        return false;
    }
    if (f_read(&g_fil, &g_hdr, sizeof(g_hdr), &got) != FR_OK ||
        got != sizeof(g_hdr) || !hdr_valid(&g_hdr)) {
        (void)f_close(&g_fil);
        return false;
    }
    if (f_read(&g_fil, TBL_BUF, g_hdr.count * 8u, &got) != FR_OK ||
        got != g_hdr.count * 8u) {
        (void)f_close(&g_fil);
        return false;
    }
    g_tbl   = TBL_BUF;
    g_src_sd = true;
    return true;
}

/* Flash：記憶體映射，檔頭與表格直接就地指過去，零複製。 */
static bool src_open_flash(void)
{
    const frames_hdr_t *h = (const frames_hdr_t *)FRAMES_BASE;

    if (!hdr_valid(h)) {
        return false;
    }
    g_hdr   = *h;
    g_tbl   = (const uint32_t *)(FRAMES_BASE + sizeof(frames_hdr_t));
    g_src_sd = false;
    return true;
}

/* 取一格。回傳的指標可以直接餵進 JPEG 解碼器。 */
static const uint8_t *src_frame(uint32_t idx, uint32_t *len)
{
    uint32_t off  = g_tbl[idx * 2u];
    uint32_t size = g_tbl[idx * 2u + 1u];
    uint32_t padded = (size + 3u) & ~3u;
    UINT     got = 0;
    uint32_t c0;

    *len = size;
    if (!g_src_sd) {
        return FRAMES_BASE + off;       /* 映射區就地解碼，不必複製 */
    }

    if (padded > FRAME_CAP) {
        return NULL;
    }
    c0 = cyc_start();
    if (f_lseek(&g_fil, off) != FR_OK) {
        return NULL;
    }
    if (f_read(&g_fil, FRAME_BUF, size, &got) != FR_OK || got != size) {
        return NULL;
    }
    /* 補到 4 的倍數並清成 0。解碼器那邊的長度會往上取整（board-notes 16.12），
     * 多讀到的必須是有效記憶體 —— 這裡自己補，就不必依賴檔案裡的補齊。 */
    memset(FRAME_BUF + size, 0, padded - size);
    g_dbg_sum_read += cyc_us(c0);
    return FRAME_BUF;
}

/* 播放中隨時可以被主機叫進燒錄模式。先把自己的檔案收乾淨再交出去。 */
static void check_writer(void)
{
    if (!sd_writer_requested()) {
        return;
    }
    if (g_src_sd) {
        (void)f_close(&g_fil);
    }
    if (g_fs_mounted) {
        (void)f_mount(NULL, g_drive, 0);
        g_fs_mounted = false;
    }
    g_dbg_stage = 20;
    sd_writer_run();                    /* 不會返回 */
}

