chunyen627-afk/stm32h7s78-project/projects/video/app_src/video_main.c
/* ------------------------------------------------------------------ */
/* 播放                                                                */
/* ------------------------------------------------------------------ */

static bool decode_frame(const uint8_t *jpg, uint32_t size)
{
    uint32_t first;

    g_out_total = 0;
    g_in_ptr    = jpg;
    g_in_left   = size;
    g_done      = 0u;
    g_cur_jpg   = jpg;
    g_cur_size  = size;
    g_in_cb     = 0u;
    g_out_cb    = 0u;

    /* 第一塊也要是 4 的倍數。HAL 在啟動時的處理是**捨去**
     * （`InDataLength - InDataLength % 4`），續傳時卻是**進位** —— 兩邊規則
     * 不一致。捨去會把尾巴留給下一次，而那個尾巴正好是 1~3 個位元組時就
     * 觸發 USE。這裡先進位，小影格就一次餵完，不會有第二次啟動。 */
    first = (size > CHUNK) ? CHUNK : ((size + 3u) & ~3u);
    if (HAL_JPEG_Decode_DMA(&g_hjpeg, (uint8_t *)jpg, first,
                            YCBCR_BUF, CHUNK) != HAL_OK) {
        g_dbg_lasterr = -3;
        return false;
    }
    {
        uint32_t t0 = HAL_GetTick();
        while (g_done == 0u) {
            if ((HAL_GetTick() - t0) > 2000u) {
                g_dbg_lasterr = -4;
                (void)HAL_JPEG_Abort(&g_hjpeg);
                return false;
            }
        }
    }
    /* 錯誤碼一定要在 DeInit 之前擷取 —— 重新初始化會把 ErrorCode 清成 0，
     * 先前 jerr/derr 全是 0 就是這個順序寫錯造成的假象。 */
    if (g_done != 1u) {
        g_dbg_jerr     = HAL_JPEG_GetError(&g_hjpeg);
        g_dbg_derr_in  = HAL_DMA_GetError(&g_dma_in);
        g_dbg_derr_out = HAL_DMA_GetError(&g_dma_out);
    }

    /* 每格之間完整重新初始化 JPEG。這是結論不是實驗（board-notes 16.8）。
     *
     * 症狀：連續 N 格之後 HAL_JPEG_Decode_DMA 永遠回傳 BUSY（相簿是第 8 張、
     * 這裡是第 24 格），而且 HAL_JPEG_Abort() 救不回來 —— 兩邊都試過。
     * 所以累積的是週邊/HAL 的狀態，不是單次操作沒收乾淨。
     * 加上這段之後可以連續播放上千格不停。
     * 成本每格幾十微秒，相對整格 31ms 可以忽略。 */
    (void)HAL_JPEG_DeInit(&g_hjpeg);
    g_hjpeg.Instance = JPEG;
    (void)HAL_JPEG_Init(&g_hjpeg);

    /* 這個 Abort 是當初驗證「永久 BUSY」假設時加的，上面的 DeInit+Init 才是
     * 真正的解法，它其實已經是多餘的（而且會把 g_dma_* 的 ErrorCode 弄髒成
     * NO_XFER，干擾之後的診斷）。先留著不動：目前這條路徑實測 1940 格 0 失敗，
     * 要拿掉應該單獨改、單獨量，不要跟修正混在同一次。 */
    (void)HAL_JPEG_Abort(&g_hjpeg);

    if (g_done != 1u) {
        g_dbg_lasterr   = -5;
        /* 啟動了非同步硬體的失敗路徑一定要收乾淨，否則週邊停在忙碌狀態，
         * 之後每次解碼都拿到 HAL_BUSY（board-notes 16.3）。 */
        (void)HAL_JPEG_Abort(&g_hjpeg);
        return false;
    }
    return true;
}

void video_run(void)
{
    JPEG_ConfTypeDef    info;
    JPEG_YCbCrToRGB_Convert_Function convert;
    uint32_t nb_mcu = 0, converted = 0;
    uint32_t idx = 0, t_run;
    uint32_t frame_us, frame_ms, frame_frac, acc = 0;

    g_dbg_stage = 1;
    psram_mpu_init();
    screen_init();

    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0;
    DWT->CTRL  |= DWT_CTRL_CYCCNTENA_Msk;

    g_hjpeg.Instance = JPEG;
    if (HAL_JPEG_Init(&g_hjpeg) != HAL_OK) {
        g_dbg_stage = 90;
        for (;;) { }
    }
    JPEG_InitColorTables();

    /* 先試 SD，沒有就退回 Flash。 */
    g_dbg_stage = 2;
    if (src_open_sd()) {
        g_dbg_src = 1;
    } else if (src_open_flash()) {
        g_dbg_src = 2;
    } else {
        g_dbg_src = 0;
    }

    g_dbg_hdr_magic = g_hdr.magic;
    g_dbg_hdr_count = g_hdr.count;
    g_dbg_hdr_w     = g_hdr.width;
    g_dbg_hdr_h     = g_hdr.height;

    if (g_dbg_src == 0u) {
        /* 兩個來源都沒有 —— 這是第一次使用的正常狀態（卡上還沒有 video.bin）。
         * **絕對不能停在這裡空轉**：主機要靠這個迴圈把板子叫進燒錄模式，
         * 卡死的話就變成「要有影片才裝得進影片」的雞生蛋問題。 */
        g_dbg_stage = 91;
        for (;;) {
            check_writer();
        }
    }

    /* 格率從檔頭讀。用微秒累加而不是「每格睡固定毫秒」—— HAL_GetTick 只有
     * 1ms 解析度，24fps 的 41.67ms 無論取 41 還是 42 都會慢慢漂掉。
     * 整數部分照加，小數部分累積到 1ms 就補一格。 */
    frame_us   = 100000000u / (g_hdr.fps_x100 ? g_hdr.fps_x100 : DEFAULT_FPS_X100);
    frame_ms   = frame_us / 1000u;
    frame_frac = frame_us % 1000u;

    g_dbg_stage = 5;
    t_run     = HAL_GetTick();
    g_next_ms = t_run;

    for (;;) {
        uint32_t       use = g_dbg_freeze ? 0u : idx;
        const uint8_t *jpg;
        uint32_t       len = 0;
        uint32_t       c_all = cyc_start();
        uint32_t       c0;

        check_writer();

        g_cur_idx = use;
        jpg = src_frame(use, &len);
        if (jpg == NULL) {
            g_dbg_fail++;
            idx = (idx + 1u) % g_hdr.count;
            continue;
        }

        c0 = cyc_start();
        if (!decode_frame(jpg, len)) {
            g_dbg_fail++;
            if (use < 128u) {
                g_dbg_failmap[use >> 5] |= 1u << (use & 31u);
            }
            idx = (idx + 1u) % g_hdr.count;
            continue;
        }
        if (use < 128u) {
            g_dbg_okmap[use >> 5] |= 1u << (use & 31u);
        }
        g_dbg_sum_dec += cyc_us(c0);

        if (HAL_JPEG_GetInfo(&g_hjpeg, &info) != HAL_OK ||
            JPEG_GetDecodeColorConvertFunc(&info, &convert, &nb_mcu) != HAL_OK) {
            g_dbg_fail++;
            idx = (idx + 1u) % g_hdr.count;
            continue;
        }

        /* 第一格才知道取樣格式，這時候設定 DMA2D。 */
        if (!g_dma2d_ready) {
            g_dma2d_ready = dma2d_setup(info.ChromaSubsampling);
            g_dbg_stage = g_dma2d_ready ? 6u : 92u;
        }

        c0 = cyc_start();
        if (g_front) { g_dbg_to_fb0++; } else { g_dbg_to_fb1++; }
        if (g_dma2d_ready) {
            /* DMA2D 讀寫都繞過 D-Cache，不必先失效快取。 */
            dma2d_convert((uint8_t *)(g_front ? FB0_ADDR : FB1_ADDR),
                          info.ImageWidth, info.ImageHeight);
        } else {
            /* 退回 CPU 轉色。這條路徑實測 64ms/格，只當保險用。 */
            SCB_InvalidateDCache_by_Addr((uint32_t *)YCBCR_BUF,
                                         (int32_t)g_out_total);
            (void)convert(YCBCR_BUF,
                          (uint8_t *)(g_front ? FB0_ADDR : FB1_ADDR),
                          0, g_out_total, &converted);
        }
        g_dbg_sum_cc += cyc_us(c0);

        c0 = cyc_start();
        if (!g_dbg_nopresent) {
            present();
        }
        g_dbg_sum_out += cyc_us(c0);

        /* 按素材的節奏放。用「下一格的目標時刻」而不是「每格睡固定時間」，
         * 否則解碼時間的抖動會累積成愈跑愈慢。 */
        g_next_ms += frame_ms;
        acc += frame_frac;
        if (acc >= 1000u) {             /* 小數毫秒滿一格就補回去 */
            acc -= 1000u;
            g_next_ms += 1u;
        }
        {
            uint32_t now = HAL_GetTick();

            if ((int32_t)(g_next_ms - now) > 0) {
                while ((int32_t)(g_next_ms - HAL_GetTick()) > 0) { }
            } else {
                /* 跟不上就重新對時，不要一直追欠下的時間。 */
                g_next_ms = now;
                g_dbg_late++;
            }
        }

        g_dbg_sum_all += cyc_us(c_all);
        g_dbg_nframe++;

        /* 每 60 格更新一次實測格率，用牆鐘時間算才包含所有開銷。 */
        if ((g_dbg_nframe % 60u) == 0u) {
            uint32_t ms = HAL_GetTick() - t_run;

            if (ms > 0u) {
                g_dbg_fps_x100 = (g_dbg_nframe * 100000u) / ms;
            }
        }
        idx = (idx + 1u) % g_hdr.count;
    }
}
